/*
2. 实现堆结构
来源: POJ (Coursera声明：在POJ上完成的习题将不会计入Coursera的最后成绩。)

注意：总时间限制: 3000ms 内存限制: 65535kB

描述
定义一个数组，初始化为空。在数组上执行两种操作：

1、增添1个元素，把1个新的元素放入数组。

2、输出并删除数组中最小的数。

使用堆结构实现上述功能的高效算法。

输入
第一行输入一个整数t，代表测试数据的组数。

对于每组测试数据，第一行输入一个整数n，代表操作的次数。

每次操作首先输入一个整数type。

当type=1，增添操作，接着输入一个整数u，代表要插入的元素。

当type=2，输出删除操作，输出并删除数组中最小的元素。

1<=n<=100000。

输出
每次删除操作输出被删除的数字。

样例输入
2
5
1 1
1 2
1 3
2
2
4
1 5
1 1
1 7
2

样例输出
1
2
1
*/
#include <iostream>
#include <deque>
using namespace std;
int main() {
  int t;
  cin >> t;
  cin.ignore();
  while (t--) {

  }

  return 0;
}